{"pageProps":{"post":{"title":"C++ Module 00","date":"2023-11-13T12:25:58.169Z","slug":"cpp_module00","author":{"name":"Amine Beihaqi","picture":"/Logo.svg"},"content":"<h1>C++ Module 00: A Dive into C++ Basics</h1>\n<h2>Introduction</h2>\n<p>C++ is a powerful general-purpose programming language that extends the functionality of the C programming language. Module 00 of the C++ curriculum at 1337 coding school is designed to introduce students to key concepts such as namespaces, classes, member functions, stdio streams, initialization lists, static, const, and other fundamental elements of C++.</p>\n<h2>General Rules</h2>\n<p>Before delving into the exercises, it's crucial to adhere to some general rules. Compilation should be done using <code>c++</code> with flags <code>-Wall -Wextra -Werror</code>, and the code should comply with the C++98 standard. The guidelines emphasize the importance of clean code, allowing developers to choose their coding style while ensuring readability for peer-evaluators.</p>\n<h2>Exercise 00: Megaphone</h2>\n<p><strong>Task:</strong> Create a program that acts as a megaphone, converting input text to uppercase.</p>\n<p><strong>Example:</strong></p>\n<pre><code class=\"language-bash\">$>./megaphone \"shhhhh... I think the students are asleep...\"\nSHHHHH... I THINK THE STUDENTS ARE ASLEEP...\n</code></pre>\n<h2>Exercise 01: My Awesome PhoneBook</h2>\n<p><strong>Task:</strong> Implement a basic phonebook application with functionalities to add, search, and display contacts.</p>\n<p><strong>Design Requirements:</strong></p>\n<ul>\n<li>Two classes: <code>PhoneBook</code> and <code>Contact</code>.</li>\n<li>PhoneBook can store up to 8 contacts, replacing the oldest if full.</li>\n<li>Contacts must include first name, last name, nickname, phone number, and darkest secret.</li>\n<li>Use public and private appropriately in class design.</li>\n</ul>\n<h2>Exercise 02: The Job Of Your Dreams</h2>\n<p><strong>Task:</strong> Recreate a deleted source file (<code>Account.cpp</code>) using provided files (<code>Account.hpp</code> and <code>tests.cpp</code>) and a log file.</p>\n<p><strong>Note:</strong> Exercise 02 is optional but offers an opportunity to showcase C++ skills.</p>\n<h2>Conclusion</h2>\n<p>Module 00 sets the foundation for the C++ journey at 1337 coding school. From basic syntax to implementing classes and handling file reconstruction, students gain hands-on experience with essential C++ concepts. The emphasis on clean code, adherence to guidelines, and the optional challenge in Exercise 02 make this module a valuable step in becoming proficient C++ developers.</p>\n<p>Remember, the journey doesn't end here; it's just the beginning of a comprehensive exploration into the world of C++. Happy coding!</p>","ogImage":{"url":"/assets/projects/dynamic-routing/1337.jpeg"},"coverImage":"/assets/projects/dynamic-routing/1337.jpeg"}},"__N_SSG":true}