{"pageProps":{"post":{"title":"Net_Practice","date":"2023-07-19T16:49:48.279Z","slug":"netpractice","author":{"name":"Amine Beihaqi","picture":"/Logo.svg"},"content":"<h1>Net_Practice: Networking Challenges</h1>\n<h2>Introduction</h2>\n<p>Welcome to Net_Practice, a practical exercise designed to immerse you in the world of networking. In this project, you'll navigate through 10 levels of networking challenges, configuring small-scale networks, and solving problems to ensure smooth operation.</p>\n<h2>General Guidelines</h2>\n<p>To conquer these challenges, you need a solid understanding of TCP/IP addressing. The networks you'll be working with are simulated and accessible through a training interface in your web browser.</p>\n<h2>Mandatory Part</h2>\n<h3>Getting Started</h3>\n<ol>\n<li>Download the attached file from the project's page.</li>\n<li>Extract the files to your preferred folder.</li>\n<li>Open the <code>index.html</code> file in your web browser.</li>\n</ol>\n<h3>Interface Overview</h3>\n<p>You'll be welcomed by the NetPractice interface, prompting you to input your login to start practicing. Alternatively, you can try the 'correction' version by leaving the field empty.</p>\n<h3>Level Challenges</h3>\n<p>For each level, you'll encounter a non-functioning network diagram with a specific goal at the top. Your mission is to solve the issues and make the network run correctly.</p>\n<h4>Available Actions:</h4>\n<ul>\n<li><strong>Check again:</strong> Verify if your configuration is correct.</li>\n<li><strong>Get my config:</strong> Download your configuration to submit it later.</li>\n</ul>\n<h3>Progressing Through Levels</h3>\n<p>Successfully completing a level unlocks a button to proceed to the next challenge. Before moving on, export your configuration using the 'Get my config' button.</p>\n<h3>Helpful Logs</h3>\n<p>At the bottom of the page, logs provide insights into why your configuration might be incorrect. Understanding TCP/IP addressing, especially in networks with routers, is crucial for success.</p>\n<h2>Submission and Peer-Evaluation</h2>\n<p>Submit your assignment in your Git repository. Each level completed corresponds to a file (10 files in total, one per level). Place them at the root of your repository.</p>\n<p>Remember to enter your login in the training interface and export a file per level using the 'Get my config' button.</p>\n<p>During the defense, you'll be evaluated on three random levels specified on the training platform. You have limited time, and external tools are not allowed, except for a simple calculator like \"bc.\"</p>\n<p>Good luck, and may your networking prowess shine!</p>","ogImage":{"url":"/assets/projects/dynamic-routing/1337.jpeg"},"coverImage":"/assets/projects/dynamic-routing/1337.jpeg"}},"__N_SSG":true}